{
  "kind": "build_request",
  "title": "Romantic Valentine single-page surprise for Shivani with neon hearts background, evasive “no” button, and meme reveal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single-page romantic experience that asks: \"Shivani,\\nWill you be my Valentine?\" and presents exactly two choices labeled \"yess\" and \"i dont like you\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create an interactive web page as a surprise for my girlfriend... to ask her to be my valentine, her name is Shivani.",
          "There should be two options: yess or i dont like you ."
        ]
      },
      "acceptanceCriteria": [
        "The main prompt includes the name \"Shivani\" and asks \"Will you be my Valentine?\".",
        "There are exactly two visible options labeled exactly \"yess\" and \"i dont like you\" (matching casing/spelling).",
        "The page is usable on iPad Chrome with responsive layout (no horizontal overflow)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a live animated full-viewport background of many small neon hollow outlined hearts that continuously float upward from the bottom of the viewport to the top, using a pink-and-white neon palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The background of the pages should be a live wallpaper of small neon hollow highlighted outlined hearts floating from the bottom of the page to up.",
          "The page should be themed romantically with a pink and white neon color heart scheme"
        ]
      },
      "acceptanceCriteria": [
        "The background covers the full viewport behind all content.",
        "At least dozens of small outlined (hollow) hearts animate upward continuously and loop seamlessly.",
        "The color palette is predominantly neon pink and white on a dark romantic background so the outlines glow clearly."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the animated hearts background interactive so user input (mouse move on desktop and touch on iPad) visibly affects nearby hearts (e.g., gentle repulsion/drift/glow change) while keeping the upward floating motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and the hearts should float upwards be fully interactive using HTML, CSS, and JavaScript so that I can easily run it on my iPad using Chrome."
        ]
      },
      "acceptanceCriteria": [
        "Pointer movement (mouse/pointer) influences hearts near the pointer in a noticeable way (e.g., repulsion and/or glow intensity increase).",
        "Touch interaction on iPad produces the same visible effect as pointer movement.",
        "Hearts continue to drift upward even while being interacted with."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make the \"i dont like you\" button evade interaction so it cannot be clicked: on hover (desktop) and on attempted tap/press (touch devices), it moves to a new on-screen position that stays within the viewport and avoids overlapping the main \"yess\" area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she hovers her cursor over Nope, it should move away so she cannot click it, forcing her to click only on yess."
        ]
      },
      "acceptanceCriteria": [
        "Hovering over the \"i dont like you\" button makes it move away before a click can occur.",
        "Attempting to tap/press the \"i dont like you\" button on touch devices also moves it away.",
        "The \"i dont like you\" button never moves off-screen and does not overlap the \"yess\" button area when it relocates.",
        "The \"yess\" button remains reliably clickable."
      ]
    },
    {
      "id": "REQ-5",
      "text": "When the user clicks \"yess\", transition to a celebratory success state that displays a meme image and the exact text: \"Hehehe Good gurl 😚💗\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she clicks Yess, show her a meme image telling her \"Hehehe Good gurl 😚💗”."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"yess\" switches the page to a success screen/state.",
        "The success screen shows a meme image and the caption text exactly \"Hehehe Good gurl 😚💗\".",
        "The success screen keeps the romantic neon styling consistent with the rest of the page."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add the required generated static meme image under `frontend/public/assets/generated` and render it directly from the frontend (no backend fetch).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she clicks Yess, show her a meme image..."
        ]
      },
      "acceptanceCriteria": [
        "A static image file exists at `frontend/public/assets/generated/valentine-meme.dim_1200x800.png`.",
        "The success view renders the image by referencing the static asset path (not via backend calls)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit immutable authentication/actor hooks or frontend/src/main.tsx; compose around them if needed.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend logic if strictly required for this UI (not expected)."
  ],
  "nonGoals": [
    "Internet Identity login or any authentication flow.",
    "Persisting accept/decline state to the backend or adding user accounts.",
    "Adding additional pages, navigation, chat, messaging, or social integrations."
  ],
  "imageRequirements": {
    "required": [
      "Meme-style romantic image with bright, high-contrast look (valentine-meme.dim_1200x800.png)"
    ],
    "edits": []
  }
}