{
  "kind": "build_request",
  "title": "Romantic Valentine single-page surprise for Shivani with neon outlined hearts, evasive 'no' button, and meme reveal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a single-page romantic experience that asks: \"Shivani,\\nWill you be my Valentine?\" and presents exactly two choices labeled \"yess\" and \"i dont like you\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Create an interactive web page as a surprise for my girlfriend... to ask her to be my valentine, her name is Shivani.\n\nThere should be two options: yess or i dont like you ."
        ]
      },
      "acceptanceCriteria": [
        "The initial screen shows the name \"Shivani,\" and the question \"Will you be my Valentine?\"",
        "Exactly two interactive buttons are visible: \"yess\" and \"i dont like you\"",
        "The page remains a single-screen/single-purpose flow (no extra navigation or features)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a live animated full-viewport background of many small neon hollow outlined hearts that continuously float upward from the bottom of the viewport to the top, using a pink-and-white neon palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "The background of the pages should be a live wallpaper of small neon hollow highlighted outlined hearts floating from the bottom of the page to up.",
          "The page should be themed romantically with a pink and white neon color heart scheme"
        ]
      },
      "acceptanceCriteria": [
        "The heart shapes are visually hollow/outlined (stroke-based), not solid-filled",
        "Hearts continuously spawn/loop from bottom-to-top and cover the full viewport behind the content",
        "The color scheme uses pink/white neon styling with a visible glow effect",
        "Animation runs smoothly on iPad Chrome at typical screen sizes"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the animated hearts background interactive so user input (mouse move on desktop and touch on iPad) visibly affects nearby hearts (e.g., gentle repulsion/drift/glow change) while keeping the upward floating motion.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the hearts should float upwards be fully interactive using HTML, CSS, and JavaScript so that I can easily run it on my iPad using Chrome."
        ]
      },
      "acceptanceCriteria": [
        "Moving the pointer on desktop causes a visible local effect on nearby hearts",
        "Touching/dragging on iPad causes a similar visible local effect on nearby hearts",
        "Interactivity does not break the continuous upward floating behavior"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Make the \"i dont like you\" button evade interaction so it cannot be clicked: on hover (desktop) and on attempted tap/press (touch devices), it moves to a new on-screen position that stays within the viewport and avoids overlapping the main \"yess\" area.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she hovers her cursor over Nope, it should move away so she cannot click it, forcing her to click only on yess."
        ]
      },
      "acceptanceCriteria": [
        "On desktop: moving the cursor onto the \"i dont like you\" button causes it to relocate before it can be clicked",
        "On iPad/touch: attempting to press/tap the \"i dont like you\" button triggers relocation instead of activation",
        "The relocated position remains fully within the viewport bounds (not off-screen)",
        "The evasive behavior remains reliable across repeated attempts"
      ]
    },
    {
      "id": "REQ-5",
      "text": "When the user clicks \"yess\", transition to a celebratory success state that displays a meme image and the exact text: \"Hehehe Good gurl 😚💗\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she clicks Yess, show her a meme image telling her \"Hehehe Good gurl 😚💗”."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"yess\" switches the UI into a success/reveal screen",
        "The success screen shows the meme image and renders the exact text \"Hehehe Good gurl 😚💗\"",
        "The romantic neon theme remains consistent on the success screen"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add the required generated static meme image under `frontend/public/assets/generated` and render it directly from the frontend (no backend fetch).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When she clicks Yess, show her a meme image telling her \"Hehehe Good gurl 😚💗”."
        ]
      },
      "acceptanceCriteria": [
        "A static asset exists at `frontend/public/assets/generated/valentine-meme.dim_1200x800.png`",
        "The success screen loads the image via a direct static path (e.g., `/assets/generated/...`)",
        "The app works when opened in iPad Chrome without requiring any backend calls for the image"
      ]
    }
  ],
  "constraints": [
    "Frontend must remain compatible with iPad Chrome (touch input supported).",
    "Do not edit files under `frontend/src/components/ui` or the immutable hook/entry paths listed in SYSTEM_CONTEXT.",
    "Backend is not required for this single-page interactive experience; avoid adding unnecessary backend logic."
  ],
  "nonGoals": [
    "Do not add multi-page routing, accounts, or authentication flows (Internet Identity not needed for this experience).",
    "Do not add external API integrations or third-party services.",
    "Do not add payments, messaging, or any real-time server features."
  ],
  "imageRequirements": {
    "required": [
      "Meme-style romantic image (valentine-meme.dim_1200x800.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}