{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Valentine single-page surprise for Hridya (interactive neon hearts + evasive button + meme success)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the prompt copy to address Hridya and show only the heading, question, and exactly two choice buttons (\"yess\" and \"i dont like you\").",
      "acceptanceCriteria": [
        "On initial load, the page displays the name \"Hridya,\" prominently.",
        "The page displays the question text \"Will you be my Valentine? 💕\".",
        "Exactly two buttons are present with labels exactly \"yess\" and \"i dont like you\" (matching casing/spaces).",
        "No other primary flows/pages/actions are introduced beyond asking and showing the success state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the main heading text from the current name to exactly \"Hridya,\" while keeping the question text exactly \"Will you be my Valentine? 💕\" and ensuring the only two choices remain labeled exactly \"yess\" and \"i dont like you\"."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure a full-viewport animated live wallpaper background of many small neon hollow outlined hearts floating upward continuously in a pink-and-white neon scheme.",
      "acceptanceCriteria": [
        "A full-viewport background animation is visible behind the UI content.",
        "Hearts are hollow/outlined with neon glow styling and use pink and white tones.",
        "Hearts continuously move upward and recycle from bottom when leaving the top of the viewport.",
        "The background remains performant and visually stable on iPad Chrome (no obvious stutter/freezing during normal interaction)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NeonHeartsBackground.tsx",
          "operation": "modify",
          "description": "Tune the canvas heart animation for iPad Chrome performance (e.g., scale heart count and drawing cost based on viewport/device) while preserving full-viewport coverage, upward motion, hollow/outlined neon hearts, and continuous recycling from bottom to top."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Verify the existing neon palette supports a consistent pink-and-white neon heart theme behind the UI, and adjust only global styles (if needed) to keep the romantic neon look without introducing additional flows or pages."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the hearts background interactive for both mouse and touch so pointer input affects nearby hearts while they continue floating upward.",
      "acceptanceCriteria": [
        "On desktop, moving the cursor near hearts causes a visible interaction effect (e.g., repulsion and increased glow).",
        "On touch devices (iPad Chrome), touch/pointer interactions also trigger the same visible interaction effect.",
        "Interactivity does not stop the hearts’ upward motion; it only modulates position/glow briefly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NeonHeartsBackground.tsx",
          "operation": "modify",
          "description": "Ensure pointer interactions work reliably on iPad Chrome by handling pointer down/move/up (and clearing state on pointer cancel/leave) so hearts visibly repel/drift and/or intensify glow near input while maintaining continuous upward floating."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Make the \"i dont like you\" button evade interaction on hover and attempted tap/press, staying fully in-viewport and avoiding overlap with the \"yess\" button area.",
      "acceptanceCriteria": [
        "Hovering over the \"i dont like you\" button causes it to move away before it can be clicked.",
        "On touch devices, attempting to press/tap the \"i dont like you\" button causes it to move away.",
        "The evasive button always stays fully within the viewport (not clipped off-screen).",
        "The evasive button does not overlap the \"yess\" button region when it relocates."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEvasiveButton.ts",
          "operation": "modify",
          "description": "Harden the evasive-position calculation so the button is always fully within viewport bounds (including after orientation/viewport changes) and consistently avoids the \"yess\" button safe region; keep behavior triggered by hover and pointer/touch attempts."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the \"i dont like you\" button wires hover and attempted press/tap interactions to the evade handler (mouse enter + pointer down/touch start) and that its positioning strategy cannot overlap the \"yess\" button area."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "On clicking \"yess\", transition to a success view displaying the meme image and the exact caption \"Hehehe Good gurl 😚💗\".",
      "acceptanceCriteria": [
        "Clicking the \"yess\" button switches to a success state (no additional confirmation needed).",
        "The success state renders a static meme image from the frontend (no backend fetch).",
        "The success state displays the exact text \"Hehehe Good gurl 😚💗\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the \"yess\" button transitions to the in-app success state via local React state (single React entry point, no routing) and renders the existing success view component."
        },
        {
          "path": "frontend/src/components/SuccessMeme.tsx",
          "operation": "modify",
          "description": "Verify the success view includes the exact caption text \"Hehehe Good gurl 😚💗\" and remains responsive within the viewport."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add the required static meme image asset and ensure the success view renders it via the static /assets/generated path responsively.",
      "acceptanceCriteria": [
        "`frontend/public/assets/generated/valentine-meme.dim_1200x800.png` exists in the project output.",
        "The success view loads the image via `src=\"/assets/generated/valentine-meme.dim_1200x800.png\"` (or equivalent static path).",
        "The meme image renders responsively within the viewport (no horizontal scrolling on iPad)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/valentine-meme.dim_1200x800.png",
          "operation": "create",
          "description": "Add the generated meme image asset at exactly this path: frontend/public/assets/generated/valentine-meme.dim_1200x800.png."
        },
        {
          "path": "frontend/src/components/SuccessMeme.tsx",
          "operation": "modify",
          "description": "Ensure the image is rendered directly from the static path \"/assets/generated/valentine-meme.dim_1200x800.png\" and styled responsively to avoid horizontal scrolling on iPad."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Update page metadata so the document title references Hridya and keep a single React entry point with no new routing.",
      "acceptanceCriteria": [
        "The browser tab title references \"Hridya\" and does not reference a different name.",
        "The page remains a single React entry point (no new routing required)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML <title> so it references \"Hridya\" and removes references to any other name, without changing the single React entry point setup."
        }
      ]
    }
  ]
}